app/controllers/parks_controller.rb

SELECT "parks".* FROM "parks"
---
  def index
    @parks = Park.all

INSERT INTO "parks" ("name", "description", "picture", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @park = Park.new(park_params)

    respond_to do |format|
      if @park.save

UPDATE "parks" SET "name" = $1, "updated_at" = $2 WHERE "parks"."id" = $3  [["name", "Olympic"], ["updated_at", 2016-09-01 23:31:11 UTC], ["id", 1]]
---
  def update
    respond_to do |format|
      if @park.update(park_params)

SELECT  "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_park
      @park = Park.find(params[:id])